<?php

return [
    'password_confirm' => [
        'heading' => 'პაროლის დადასტურება',
        'description' => 'გთხოვთ დაადასტუროთ თქვენი პაროლი ამ მოქმედების დასასრულებლად.',
        'current_password' => 'მიმდინარე პაროლი',
    ],
    'two_factor' => [
        'heading' => 'ორფაქტორიანი ავტორიზაცია',
        'description' => 'გთხოვთ დაადასტუროთ წვდომა თქვენს ანგარიშზე ავთენტიფიკატორის აპლიკაციის მიერ მოწოდებული კოდის შეყვანით.',
        'code_placeholder' => 'XXX-XXX',
        'recovery' => [
            'heading' => 'ორფაქტორიანი ავტორიზაცია',
            'description' => 'გთხოვთ დაადასტუროთ წვდომა თქვენს ანგარიშზე ერთ-ერთი საგანგებო აღდგენის კოდის შეყვანით.',
        ],
        'recovery_code_placeholder' => 'abcdef-98765',
        'recovery_code_text' => 'დაკარგეთ მოწყობილობა?',
        'recovery_code_link' => 'გამოიყენეთ აღდგენის კოდი',
        'back_to_login_link' => 'დაბრუნება ავტორიზაციაზე',
    ],
    'passkeys' => [
        'authenticate_using_passkey' => [
            'label' => 'ავტორიზაცია Passkey-ით',
        ],
        'invalid' => 'მოცემული passkey-ით შესვლა ვერ მოხერხდა.',
    ],
    'profile' => [
        'account' => 'ანგარიში',
        'profile' => 'პროფილი',
        'my_profile' => 'ჩემი პროფილი',
        'subheading' => 'მართეთ თქვენი მომხმარებლის პროფილი.',
        'personal_info' => [
            'heading' => 'პირადი ინფორმაცია',
            'subheading' => 'მართეთ თქვენი პირადი ინფორმაცია.',
            'submit' => [
                'label' => 'განახლება',
            ],
            'notify' => 'პროფილი წარმატებით განახლდა!',
        ],
        'password' => [
            'heading' => 'პაროლი',
            'subheading' => 'უნდა იყოს მინიმუმ 8 სიმბოლო.',
            'submit' => [
                'label' => 'განახლება',
            ],
            'notify' => 'პაროლი წარმატებით განახლდა!',
        ],
        '2fa' => [
            'title' => 'ორფაქტორიანი ავთენტიფიკაცია',
            'description' => 'მართეთ ორფაქტორიანი ავთენტიფიკაცია თქვენი ანგარიშისთვის (რეკომენდებულია).',
            'actions' => [
                'enable' => 'ჩართვა',
                'regenerate_codes' => 'აღდგენის კოდების ხელახლა გენერირება',
                'disable' => 'გამორთვა',
                'confirm_finish' => 'დადასტურება და დასრულება',
                'cancel_setup' => 'გაუქმება',
                'confirm' => 'დადასტურება',
            ],
            'setup_key' => 'დაყენების გასაღები',
            'must_enable' => 'ამ აპლიკაციის გამოსაყენებლად უნდა ჩართოთ ორფაქტორიანი ავთენტიფიკაცია.',
            'not_enabled' => [
                'title' => 'თქვენ არ გაქვთ ჩართული ორფაქტორიანი ავთენტიფიკაცია.',
                'description' => 'როდესაც ორფაქტორიანი ავთენტიფიკაცია ჩართულია, ავტორიზაციისას მოგეთხოვებათ უსაფრთხო, შემთხვევითი ტოკენი. ამისთვის შეგიძლიათ გამოიყენოთ ავთენტიფიკატორის აპლიკაციები თქვენს სმარტფონზე, როგორიცაა Google Authenticator, Microsoft Authenticator და ა.შ.',
            ],
            'finish_enabling' => [
                'title' => 'დაასრულეთ ორფაქტორიანი ავთენტიფიკაციის ჩართვა.',
                'description' => 'ორფაქტორიანი ავთენტიფიკაციის ჩართვის დასასრულებლად, დაასკანირეთ შემდეგი QR კოდი თქვენი ტელეფონის ავთენტიფიკატორის აპლიკაციით ან შეიყვანეთ დაყენების გასაღები და მიუთითეთ გენერირებული OTP კოდი.',
            ],
            'enabled' => [
                'notify' => 'ორფაქტორიანი ავთენტიფიკაცია ჩართულია.',
                'title' => 'თქვენ ჩართეთ ორფაქტორიანი ავთენტიფიკაცია!',
                'description' => 'ორფაქტორიანი ავთენტიფიკაცია ახლა ჩართულია. ეს ეხმარება თქვენი ანგარიშის უფრო მეტად დაცვას.',
                'store_codes' => 'ეს კოდები შეიძლება გამოყენებულ იქნას თქვენს ანგარიშზე წვდომის აღსადგენად, თუ თქვენი მოწყობილობა დაიკარგება. გაფრთხილება! ეს კოდები მხოლოდ ერთხელ გამოჩნდება.',
            ],
            'disabling' => [
                'notify' => 'ორფაქტორიანი ავთენტიფიკაცია გამორთულია.',
            ],
            'regenerate_codes' => [
                'notify' => 'ახალი აღდგენის კოდები გენერირებულია.',
            ],
            'confirmation' => [
                'success_notification' => 'კოდი დადასტურებულია. ორფაქტორიანი ავთენტიფიკაცია ჩართულია.',
                'invalid_code' => 'თქვენ მიერ შეყვანილი კოდი არასწორია.',
            ],
        ],
        'sanctum' => [
            'title' => 'API ტოკენები',
            'description' => 'მართეთ API ტოკენები, რომლებიც საშუალებას აძლევს მესამე მხარის სერვისებს თქვენი სახელით შევიდნენ ამ აპლიკაციაში.',
            'create' => [
                'notify' => 'ტოკენი წარმატებით შეიქმნა!',
                'message' => 'თქვენი ტოკენი მხოლოდ ერთხელ გამოჩნდება შექმნისას. თუ დაკარგავთ ტოკენს, მოგიწევთ მისი წაშლა და ახლის შექმნა.',
                'submit' => [
                    'label' => 'შექმნა',
                ],
            ],
            'update' => [
                'notify' => 'ტოკენი წარმატებით განახლდა!',
                'submit' => [
                    'label' => 'განახლება',
                ],
            ],
            'copied' => [
                'label' => 'მე დავაკოპირე ჩემი ტოკენი',
            ],
        ],
        'browser_sessions' => [
            'heading' => 'ბრაუზერის სესიები',
            'subheading' => 'მართეთ თქვენი აქტიური სესიები.',
            'label' => 'ბრაუზერის სესიები',
            'content' => 'საჭიროების შემთხვევაში, შეგიძლიათ გამოხვიდეთ თქვენი ყველა სხვა ბრაუზერის სესიიდან ყველა თქვენს მოწყობილობაზე. ზოგიერთი თქვენი ბოლო სესია ჩამოთვლილია ქვემოთ; თუმცა, ეს სია შეიძლება არ იყოს ამომწურავი. თუ ფიქრობთ, რომ თქვენი ანგარიში საფრთხის ქვეშაა, ასევე უნდა განაახლოთ თქვენი პაროლი.',
            'device' => 'ეს მოწყობილობა',
            'last_active' => 'ბოლოს აქტიური',
            'logout_other_sessions' => 'სხვა ბრაუზერის სესიებიდან გამოსვლა',
            'logout_heading' => 'სხვა ბრაუზერის სესიებიდან გამოსვლა',
            'logout_description' => 'გთხოვთ შეიყვანოთ თქვენი პაროლი, რათა დაადასტუროთ, რომ გსურთ გამოხვიდეთ თქვენი სხვა ბრაუზერის სესიებიდან ყველა თქვენს მოწყობილობაზე.',
            'logout_action' => 'სხვა ბრაუზერის სესიებიდან გამოსვლა',
            'incorrect_password' => 'შეყვანილი პაროლი არასწორია. გთხოვთ, სცადოთ თავიდან.',
            'logout_success' => 'სხვა ბრაუზერის სესიებიდან გამოსვლა წარმატებით დასრულდა.',
        ],
        'passkeys' => [
            'heading' => 'Passkeys',
            'description' => 'მართეთ passkey-ები თქვენს ანგარიშზე უპაროლო და უსაფრთხო წვდომისთვის ყველა მოწყობილობაზე.',
            'create' => [
                'notify' => 'ტოკენი წარმატებით შეიქმნა!',
                'message' => 'თქვენი ტოკენი მხოლოდ ერთხელ გამოჩნდება შექმნისას. თუ დაკარგავთ ტოკენს, მოგიწევთ მისი წაშლა და ახლის შექმნა.',
                'submit' => [
                    'label' => 'შექმნა',
                    'submit_label' => 'შექმნა და ავტორიზაცია',
                ],
                'error_message' => 'Passkey-ის გენერირებისას დაფიქსირდა შეცდომა.',
                'success_message' => 'Passkey წარმატებით შეიქმნა.',
            ],
            'update' => [
                'notify' => 'ტოკენი წარმატებით განახლდა!',
                'submit' => [
                    'label' => 'განახლება',
                ],
            ],
        ],
    ],
    'clipboard' => [
        'link' => 'ბუფერში კოპირება',
        'tooltip' => 'კოპირებულია!',
    ],
    'fields' => [
        'avatar' => 'ავატარი',
        'email' => 'ელფოსტა',
        'login' => 'ავტორიზაცია',
        'name' => 'სახელი',
        'password' => 'პაროლი',
        'password_confirm' => 'პაროლის დადასტურება',
        'new_password' => 'ახალი პაროლი',
        'new_password_confirmation' => 'პაროლის დადასტურება',
        'token_name' => 'ტოკენის სახელი',
        'token_expiry' => 'ტოკენის ვადა',
        'abilities' => 'შესაძლებლობები',
        '2fa_code' => 'კოდი',
        '2fa_recovery_code' => 'აღდგენის კოდი',
        'created' => 'შექმნილია',
        'expires' => 'ვადა გასდის',
        'passkey_name' => 'Passkey-ის სახელი',
        'last_used_at' => 'ბოლოს გამოყენებული',
    ],
    'permissions' => [
        'create' => 'შექმნა',
        'view' => 'ნახვა',
        'update' => 'განახლება',
        'delete' => 'წაშლა',
    ],
    'or' => 'ან',
    'cancel' => 'გაუქმება',
    'login' => [
        'username_or_email' => 'მომხმარებლის სახელი ან ელფოსტა',
        'forgot_password_link' => 'დაგავიწყდათ პაროლი?',
        'create_an_account' => 'შექმენით ანგარიში',
    ],
    'registration' => [
        'title' => 'რეგისტრაცია',
        'heading' => 'ახალი ანგარიშის შექმნა',
        'submit' => [
            'label' => 'რეგისტრაცია',
        ],
        'notification_unique' => 'ანგარიში ამ ელფოსტით უკვე არსებობს. გთხოვთ გაიაროთ ავტორიზაცია.',
    ],
    'reset_password' => [
        'title' => 'დაგავიწყდათ პაროლი?',
        'heading' => 'პაროლის აღდგენა',
        'submit' => [
            'label' => 'გაგზავნა',
        ],
        'notification_error' => 'შეცდომა: გთხოვთ, სცადოთ მოგვიანებით.',
        'notification_error_link_text' => 'სცადეთ თავიდან',
        'notification_success' => 'შეამოწმეთ თქვენი ელფოსტა შემდგომი ინსტრუქციებისთვის!',
    ],
    'verification' => [
        'title' => 'დაადასტურეთ თქვენი ელფოსტა',
        'heading' => 'საჭიროა ელფოსტის დადასტურება',
        'submit' => [
            'label' => 'გამოსვლა',
        ],
        'notification_success' => 'შეამოწმეთ თქვენი ელფოსტა შემდგომი ინსტრუქციებისთვის!',
        'notification_resend' => 'ახალი დადასტურების ელფოსტა გაიგზავნა.',
        'before_proceeding' => 'გაგრძელებამდე, გთხოვთ, შეამოწმოთ თქვენი ელფოსტა დადასტურების ბმულისთვის.',
        'not_receive' => 'თუ არ მიგიღიათ ელფოსტა,',
        'request_another' => 'დააწკაპუნეთ აქ ხელახლა გასაგზავნად',
    ],
];
