<?php

return [
    'password_confirm' => [
        'heading' => 'პაროლის დადასტურება',
        'description' => 'მოქმედების დასასრულებლად გთხოვთ, დაადასტუროთ პაროლი.',
        'current_password' => 'მიმდინარე პაროლი',
    ],
    'two_factor' => [
        'heading' => 'ორფაქტორიანი ავთენტიფიკაცია',
        'description' => 'გთხოვთ, დაადასტუროთ ანგარიშზე წვდომა ავთენტიფიკატორი აპლიკაციის მიერ მოწოდებული კოდის შეყვანით.',
        'code_placeholder' => 'XXX-XXX',
        'recovery' => [
            'heading' => 'ორფაქტორიანი ავთენტიფიკაცია',
            'description' => 'გთხოვთ, დაადასტუროთ ანგარიშზე წვდომა ერთ-ერთი სარეზერვო აღდგენის კოდის შეყვანით.',
        ],
        'recovery_code_placeholder' => 'abcdef-98765',
        'recovery_code_text' => 'დაკარგეთ მოწყობილობა?',
        'recovery_code_link' => 'აღდგენის კოდის გამოყენება',
        'back_to_login_link' => 'ავტორიზაციაზე დაბრუნება',
    ],
    'passkeys' => [
        'authenticate_using_passkey' => [
            'label' => 'შესვლა Passkey-ით',
        ],
        'invalid' => 'მითითებული Passkey-ით შესვლა ვერ მოხერხდა.',
    ],
    'profile' => [
        'account' => 'ანგარიში',
        'profile' => 'პროფილი',
        'my_profile' => 'ჩემი პროფილი',
        'subheading' => 'მართეთ თქვენი მომხმარებლის პროფილი.',
        'personal_info' => [
            'heading' => 'პირადი ინფორმაცია',
            'subheading' => 'მართეთ თქვენი პირადი ინფორმაცია.',
            'submit' => [
                'label' => 'განახლება',
            ],
            'notify' => 'პროფილი წარმატებით განახლდა!',
        ],
        'password' => [
            'heading' => 'პაროლი',
            'subheading' => 'უნდა შედგებოდეს მინიმუმ 8 სიმბოლოსგან.',
            'submit' => [
                'label' => 'განახლება',
            ],
            'notify' => 'პაროლი წარმატებით განახლდა!',
        ],
        '2fa' => [
            'title' => 'ორფაქტორიანი ავთენტიფიკაცია',
            'description' => 'მართეთ თქვენი ანგარიშის ორფაქტორიანი ავთენტიფიკაცია (რეკომენდებულია).',
            'actions' => [
                'enable' => 'ჩართვა',
                'regenerate_codes' => 'აღდგენის კოდების ხელახლა გენერირება',
                'disable' => 'გამორთვა',
                'confirm_finish' => 'დადასტურება და დასრულება',
                'cancel_setup' => 'დაყენების გაუქმება',
                'confirm' => 'დადასტურება',
            ],
            'setup_key' => 'დაყენების გასაღები',
            'must_enable' => 'ამ აპლიკაციის გამოსაყენებლად აუცილებელია ორფაქტორიანი ავთენტიფიკაციის ჩართვა.',
            'not_enabled' => [
                'title' => 'ორფაქტორიანი ავთენტიფიკაცია ჩართული არ გაქვთ.',
                'description' => 'ორფაქტორიანი ავთენტიფიკაციის ჩართვის შემთხვევაში, ავტორიზაციისას მოგეთხოვებათ უსაფრთხო, შემთხვევითი კოდი. ამ კოდს მიიღებთ თქვენი ტელეფონის ავთენტიფიკატორი აპლიკაციიდან (მაგ. Microsoft Authenticator, Google Authenticator).',
            ],
            'finish_enabling' => [
                'title' => 'დაასრულეთ ორფაქტორიანი ავთენტიფიკაციის ჩართვა.',
                'description' => 'ორფაქტორიანი ავთენტიფიკაციის ჩართვის დასასრულებლად დაასკანერეთ ქვემოთ მოცემული QR კოდი ტელეფონის ავთენტიფიკატორი აპლიკაციით ან შეიყვანეთ დაყენების გასაღები და მიუთითეთ გენერირებული ერთჯერადი კოდი (OTP).',
            ],
            'enabled' => [
                'notify' => 'ორფაქტორიანი ავთენტიფიკაცია ჩაირთო.',
                'title' => 'ორფაქტორიანი ავთენტიფიკაცია ჩართულია!',
                'description' => 'ორფაქტორიანი ავთენტიფიკაცია ახლა ჩართულია. ეს თქვენს ანგარიშს უფრო დაცულს ხდის.',
                'store_codes' => 'ეს კოდები შეგიძლიათ გამოიყენოთ ანგარიშზე წვდომის აღსადგენად, თუ მოწყობილობას დაკარგავთ. ყურადღება! ეს კოდები მხოლოდ ერთხელ გამოჩნდება.',
            ],
            'disabling' => [
                'notify' => 'ორფაქტორიანი ავთენტიფიკაცია გამოირთო.',
            ],
            'regenerate_codes' => [
                'notify' => 'ახალი აღდგენის კოდები დაგენერირდა.',
            ],
            'confirmation' => [
                'success_notification' => 'კოდი დადასტურდა. ორფაქტორიანი ავთენტიფიკაცია ჩაირთო.',
                'invalid_code' => 'შეყვანილი კოდი არასწორია.',
            ],
        ],
        'sanctum' => [
            'title' => 'API ტოკენები',
            'description' => 'მართეთ API ტოკენები, რომლებიც მესამე მხარის სერვისებს საშუალებას აძლევს, თქვენი სახელით მიიღონ წვდომა ამ აპლიკაციაზე.',
            'create' => [
                'notify' => 'ტოკენი წარმატებით შეიქმნა!',
                'message' => 'ტოკენი მხოლოდ შექმნისას ჩანს ერთხელ. თუ ტოკენს დაკარგავთ, მოგიწევთ მისი წაშლა და ახლის შექმნა.',
                'submit' => [
                    'label' => 'შექმნა',
                ],
            ],
            'update' => [
                'notify' => 'ტოკენი წარმატებით განახლდა!',
                'submit' => [
                    'label' => 'განახლება',
                ],
            ],
            'copied' => [
                'label' => 'ტოკენი დავაკოპირე',
            ],
        ],
        'browser_sessions' => [
            'heading' => 'ბრაუზერის სესიები',
            'subheading' => 'მართეთ თქვენი აქტიური სესიები.',
            'label' => 'ბრაუზერის სესიები',
            'content' => 'საჭიროების შემთხვევაში, შეგიძლიათ გამოხვიდეთ ყველა სხვა ბრაუზერის სესიიდან ყველა მოწყობილობაზე. ქვემოთ მოცემულია თქვენი ბოლო სესიების ნაწილი, თუმცა ეს სია შეიძლება სრული არ იყოს. თუ ფიქრობთ, რომ თქვენი ანგარიში კომპრომეტირებულია, ასევე განაახლეთ პაროლი.',
            'device' => 'ეს მოწყობილობა',
            'last_active' => 'ბოლო აქტივობა',
            'logout_other_sessions' => 'სხვა ბრაუზერის სესიებიდან გასვლა',
            'logout_heading' => 'სხვა ბრაუზერის სესიებიდან გასვლა',
            'logout_description' => 'გთხოვთ, შეიყვანოთ პაროლი იმის დასადასტურებლად, რომ გსურთ ყველა მოწყობილობაზე სხვა ბრაუზერის სესიებიდან გასვლა.',
            'logout_action' => 'სხვა ბრაუზერის სესიებიდან გასვლა',
            'incorrect_password' => 'შეყვანილი პაროლი არასწორია. გთხოვთ, სცადოთ ხელახლა.',
            'logout_success' => 'ყველა სხვა ბრაუზერის სესია წარმატებით დასრულდა.',
        ],
        'passkeys' => [
            'heading' => 'Passkey-ები',
            'description' => 'მართეთ Passkey-ები ანგარიშზე უპაროლო და უსაფრთხო წვდომისთვის ნებისმიერი მოწყობილობიდან.',
            'create' => [
                'submit' => [
                    'label' => 'შექმნა',
                    'submit_label' => 'შექმნა და ავთენტიფიკაცია',
                ],
                'error_message' => 'Passkey-ის გენერირებისას დაფიქსირდა შეცდომა.',
                'success_message' => 'Passkey წარმატებით შეიქმნა.',
            ],
            'update' => [
                'submit' => [
                    'label' => 'განახლება',
                ],
            ],
        ],
    ],
    'clipboard' => [
        'link' => 'ბუფერში კოპირება',
        'tooltip' => 'დაკოპირდა!',
    ],
    'fields' => [
        'avatar' => 'ავატარი',
        'email' => 'ელ. ფოსტა',
        'login' => 'მომხმარებლის სახელი',
        'name' => 'სახელი',
        'password' => 'პაროლი',
        'password_confirm' => 'პაროლის დადასტურება',
        'new_password' => 'ახალი პაროლი',
        'new_password_confirmation' => 'პაროლის დადასტურება',
        'token_name' => 'ტოკენის სახელი',
        'token_expiry' => 'ტოკენის ვადა',
        'abilities' => 'უფლებები',
        '2fa_code' => 'კოდი',
        '2fa_recovery_code' => 'აღდგენის კოდი',
        'created' => 'შექმნილია',
        'expires' => 'ვადა იწურება',
        'passkey_name' => 'Passkey-ის სახელი',
        'last_used_at' => 'ბოლოს გამოყენებული',
    ],
    'permissions' => [
        'create' => 'შექმნა',
        'view' => 'ნახვა',
        'update' => 'განახლება',
        'delete' => 'წაშლა',
    ],
    'or' => 'ან',
    'cancel' => 'გაუქმება',
    'login' => [
        'username_or_email' => 'მომხმარებლის სახელი ან ელ. ფოსტა',
        'forgot_password_link' => 'დაგავიწყდათ პაროლი?',
        'create_an_account' => 'ანგარიშის შექმნა',
    ],
    'registration' => [
        'title' => 'რეგისტრაცია',
        'heading' => 'ახალი ანგარიშის შექმნა',
        'submit' => [
            'label' => 'რეგისტრაცია',
        ],
        'notification_unique' => 'ამ ელ. ფოსტით ანგარიში უკვე არსებობს. გთხოვთ, გაიაროთ ავტორიზაცია.',
    ],
    'reset_password' => [
        'title' => 'დაგავიწყდათ პაროლი?',
        'heading' => 'პაროლის აღდგენა',
        'submit' => [
            'label' => 'გაგზავნა',
        ],
        'notification_error' => 'შეცდომა: გთხოვთ, სცადოთ მოგვიანებით.',
        'notification_error_link_text' => 'ხელახლა ცდა',
        'notification_success' => 'შემდგომი ინსტრუქციებისთვის შეამოწმეთ ელ. ფოსტა!',
    ],
    'verification' => [
        'title' => 'ელ. ფოსტის ვერიფიკაცია',
        'heading' => 'საჭიროა ელ. ფოსტის ვერიფიკაცია',
        'submit' => [
            'label' => 'გასვლა',
        ],
        'notification_success' => 'შემდგომი ინსტრუქციებისთვის შეამოწმეთ ელ. ფოსტა!',
        'notification_resend' => 'ვერიფიკაციის ახალი წერილი გაიგზავნა.',
        'before_proceeding' => 'გაგრძელებამდე გთხოვთ, შეამოწმოთ ელ. ფოსტა ვერიფიკაციის ბმულისთვის.',
        'not_receive' => 'თუ წერილი არ მიგიღიათ,',
        'request_another' => 'დააჭირეთ აქ ახლის მოსათხოვად',
    ],
];
